;-----------------------------------------------------------------------------------------
;Това е пример на асемблер в , който е демонстрирано подпрограми за изчакване чрез и без използване на 
;бградените таймери
;
;
;18.04.2021 		Автор: С. Банчев
;-----------------------------------------------------------------------------------------

ORG	0000H 	;място на което се установява PC след рестарт
	SJMP INITIAL

	
ORG 	000BH	;място от програмната памет където се разполага 
	SJMP TMR0_INTR	;вектора на прекъсване от таймер 0

;ORG	001BH	;място от програмната памет където се разполага 
;	SJMP TMR1_INTR	;вектора на прекъсване от таймер 1

;ORG	0003H	;място от програмната памет където се разполага 
;	SJMP INT0_INTR ;вектора на прекъсване от външен източник 0

;ORG	0013H ;място от програмната памет където се разполага 
;	SJMP INT1_INTR	;вектора на прекъсване от външен източник 1

;ORG	0023H	;място от програмната памет където се разполага 
;	SJMP UART_INT	;вектора на прекъсване от асинхрония приемо предавател на данни


DECRES 	EQU 30H	;Директива за дефиниране на константа
MYBIT	EQU 02H
ORG	0030H	;Започване на стартовата програма от адрес 30H на програмната памет

INITIAL:
	;Включване на таймер 0
	MOV TMOD,#00000010B ;Тестване на различните видове работи на таймера чрез битове М10 и М00
	MOV TCON,#00010010B ;Конфигуриране на таймер 0
	MOV IE,#10000010B ;Разрешеаване на прекъсване от таймер 0
	MOV TH0,#005
START:

	CALL WAIT_US
	JMP $
	
;-----------------------------------------------------------------------------------
;Подпрограми за изчакване
;-----------------------------------------------------------------------------------
	
;Подпрограма изчакваща около 10 uS
WAIT_US:
	MOV R0,#5
	DJNZ R0,$
	RET

	
TMR0_INTR:
	NOP
	CLR TF0
	RETI	
	END