;-----------------------------------------------------------------------------------------
;Това е пример на асемблер в , който е демонстрирано различни инструкции за математични и логически 
; пресмятания 8051
;
;
;04.04.2021 		Автор: С. Банчев
;-----------------------------------------------------------------------------------------

ORG	0000H 	;място на което се установява PC след рестарт
	SJMP START

	
;ORG 	000BH	;място от програмната памет където се разполага 
;	SJMP TMR0_INTR	;вектора на прекъсване от таймер 0

;ORG	001BH	;място от програмната памет където се разполага 
;	SJMP TMR1_INTR	;вектора на прекъсване от таймер 1

;ORG	0003H	;място от програмната памет където се разполага 
;	SJMP INT0_INTR ;вектора на прекъсване от външен източник 0

;ORG	0013H ;място от програмната памет където се разполага 
;	SJMP INT1_INTR	;вектора на прекъсване от външен източник 1

;ORG	0023H	;място от програмната памет където се разполага 
;	SJMP UART_INT	;вектора на прекъсване от асинхрония приемо предавател на данни


MYBYTE 	EQU 30H	;Директива за дефиниране на константа
MYBIT	EQU 02H
ORG	0030H	;Започване на стартовата програма от адрес 30H на програмната памет

START:
	CPL OV
	
	MOV A, #51
	MOV B, #5
	MUL AB

	MOV A,#51
	MOV B,#6
	MUL AB

	MOV A,#22
	MOV B,#7
	DIV AB

	

	NOP
	JMP ELOOP

	END