;-----------------------------------------------------------------------------------------
;Това е пример на асемблер в , който е демонстрирано различни видове инструкции за 
;извикване на подпрограми, инструкции за установяване в различни области на програмната памет
;както и инструкции за логически проверки
;
;25.03.2021 		Автор: С. Банчев
;-----------------------------------------------------------------------------------------

ORG	0000H 	;място на което се установява PC след рестарт
	SJMP START ;инструкция за късо прескачане +127 до -128 байта от програмната памет

	
;ORG 	000BH	;място от програмната памет където се разполага 
;	SJMP TMR0_INTR	;вектора на прекъсване от таймер 0

;ORG	001BH	;място от програмната памет където се разполага 
;	SJMP TMR1_INTR	;вектора на прекъсване от таймер 1

;ORG	0003H	;място от програмната памет където се разполага 
;	SJMP INT0_INTR ;вектора на прекъсване от външен източник 0

;ORG	0013H ;място от програмната памет където се разполага 
;	SJMP INT1_INTR	;вектора на прекъсване от външен източник 1

;ORG	0023H	;място от програмната памет където се разполага 
;	SJMP UART_INT	;вектора на прекъсване от асинхрония приемо предавател на данни

ORG	0030H ;Директива за поместване на инструкциите от адрес 0х30 на програмната памет
START:
	;Откоментирай долния ред за да видиш съобщение за грешка при компилация.
	;SJMP CODE_PLACE_1 ;CODE_PLACE_1 е на място START + 0xff и инструкция SJMP не върши работа
	LJMP CODE_PLACE_1 ;Тази инструкция ще ни отпрати там, тъй като тя адресира може да адресира цялата памет
	JMP CODE_PLACE_1 ;Когато не сме сигурни колко е далече мястото можем да ползваме JMP 
			;компилатора сам ще подбере дали да ползва LJMP или SJMP
INITIAL:
	LCALL SUBROUTINE1 ;Записва в стека PC и установява PC на адрес SUBROUTINE1
	MOV A, #10
LOOP1:
	DEC A	;намаляване на акумулатора
	JNZ LOOP1 ;ако акумулатора е различен от нула отиди на адрес LOOP1
	MOV A, #255
LOOP2:
	INC A ;увеличи акумулатора 
	JZ LOOP2 ;ако резултата в акумулатора е нула отиди на адрес LOOP2
LOOP3:
	RLC A ;върти на ляво акумулатора през флага за пренос
	JNC LOOP3 ;иди на LOOP3 ако флага за пренос е 1

	MOV R0, #10
LOOP4:
	DJNZ R0, LOOP4 ;намали R0 ако е различно от нула иди на LOOP4
LOOP5:	
	INC R1
	CJNE R1, #0Ah , LOOP5 ;сравни R1 със 0х0А, ако не са равни иди на LOOP5
	
	NOP	;безкраен цикъл
	SJMP $-1

CODE_PLACE_1:
ORG	12FH	
	LJMP INITIAL

SUBROUTINE1:
	NOP
	NOP
	RET ;връща от стека програмния брояч на адреса преди извикването на подпрограмата
;ORG 1FFH
END